Revit 2024 API
ParameterTypeId.SteelElemPaintArea Property
 "Paint Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemPaintArea { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemPaintArea As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemPaintArea {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace